# 1 - тапшырма
"""
Функция жазыныздар, анын аты is_triangle болсун
жана ал озуно 3 параметр алсын(уч бурчтуктун уч жагы),
текшериш керек ошол берилген уч сан менен уч бурчтук
тузууго болобу. Эгер болос функция True деген болбосо False
деген жооп кайтарыш керек

Мисалы:
is_triangle(3, 6, 10) бизге кайтарыш керек False
is_triangle(3, 6, 8) бизге кайтарыш керек True
"""

def is_triangle(a, b, c):
    return a + b > c and a + c > b and b + c > a

res = is_triangle(3, 5, 6)
print(res)


# 2 - тапшырма
"""
Функция жазыныздар, анын аты is_large болсун
жана ал озуно 1 параметр алсын(текст),
текшериш керек ошол берилген тексттин узундугу учтон
чон болсо функция True деген болбосо False
деген жооп кайтарыш керек

Мисалы:
is_large("I love Python!") бизге кайтарыш керек True
is_large("Hi") бизге кайтарыш керек False
"""

def is_lage(text):
    return len(text) > 3

# t = input("Введите текст: ")
res = is_lage(text="Okurmen")
print(res)


# 3 - тапшырма
"""
Бир функция жазыныздар, анын бир параметри болот(ал сан int болуш керек)
функция текшериш керек эгер берилген сан жуп болсо True
болбосо False кайтарыш керек

Санды консольдон алып, аны функцияга аргумент катары бериниздер


Мисалы:
5 деген сан берсек функция кайтарыш керек False
6 деген сан берсек функция кайтарыш керек True
"""

def is_jup(number):
    return number % 2 == 0

res = is_jup(3)
print(res)
