MORSE_CODE_DICT = {
    'A': '.-', 
    'B': '-...', 
    'C': '-.-.', 
    'D': '-..', 
    'E': '.',
    'F': '..-.', 
    'G': '--.', 
    'H': '....', 
    'I': '..', 
    'J': '.---',
    'K': '-.-', 
    'L': '.-..', 
    'M': '--', 
    'N': '-.', 
    'O': '---',
    'P': '.--.', 
    'Q': '--.-', 
    'R': '.-.', 
    'S': '...', 
    'T': '-',
    'U': '..-', 
    'V': '...-', 
    'W': '.--', 
    'X': '-..-', 
    'Y': '-.--',
    'Z': '--..', 
    '0': '-----', 
    '1': '.----', 
    '2': '..---', 
    '3': '...--',
    '4': '....-', 
    '5': '.....', 
    '6': '-....', 
    '7': '--...', 
    '8': '---..',
    '9': '----.',
    ' ': ' ',
}

"""
Программага консольдон текст берилет(инпут менен),
ал текстти Азбука Морзе форматына айландыруу керек.
Азбука Морзе создугу жогоруда корсотулгон.

Мисалы:
Arsen Kenzhegulov

Жоопко:
.- .-. ... . -. -.- . -. --.. .... . --. ..- .-.. --- ...- 

"""
message = input()
for i in message:
    print(MORSE_CODE_DICT.get(i.upper()), end="")
