# 1 - тапшырма
'''
Бизге консольдон бир текст берилет,
анын узундугун чыгарыныздар.
Мисалы:
Python is fun! деген текст берилсе
Жоопко:
14 деп чыгыш керек
'''


# 2 - тапшырма
'''
Бизге консольдон эки текст берилет,
биринчи текст экинчи текстин ичинде 
бар болсо YES болбосо NO деп чыгарыныздар
1 - мисалы:
London
Lon
Жоопко:
YES

2 - мисал
Bishkek
Osh
Жоопко:
NO
'''


print(ord("n"), ord("s"))
# 3 - тапшырма
'''
Бизге консольдон эки текст берилет,
биринчи текст экинчи текстин чон болсо
анда 1 болбосо 2 деп чыгарыныздар
1 - мисалы:
London
Los-Angeles
Жоопко:
2
Тушундурмо: Анткени Los-Angeles London дон чон(s чон n ден)

2 - мисал
Batken
Bishkek
Жоопко:
1
Тушундурмо: Анткени Batken Bishkek тен чон(i чон a дан)
'''