# 1 - тапшырма
'''
Бизге консольдон бир текст берилет,
анын узундугун чыгарыныздар.
Мисалы:
Python is fun! деген текст берилсе
Жоопко:
14 деп чыгыш керек
'''
text = input("Text: ")
print(len(text))


# 2 - тапшырма
'''
Бизге консольдон эки текст берилет,
биринчи текст экинчи текстин ичинде 
бар болсо YES болбосо NO деп чыгарыныздар
1 - мисалы:
London
Lon
Жоопко:
YES

2 - мисал
Bishkek
Osh
Жоопко:
NO
'''
text_1 = input("text 1: ")
text_2 = input("text_2: ")
a = text_2 in text_1
print(a)


# 3 - тапшырма
'''
Бизге консольдон эки текст берилет,
биринчи текст экинчи текстин чон болсо
анда 1 болбосо 2 деп чыгарыныздар
1 - мисалы:
London
Los-Angeles
Жоопко:
2
Тушундурмо: Анткени Los-Angeles London дон чон(s чон n ден)

2 - мисал
Batken
Bishkek
Жоопко:
1
Тушундурмо: Анткени Batken Bishkek тен чон(i чон a дан)
'''


text_1 = input("text 1: ")
text_2 = input("text_2: ")
result = text_1 > text_2
print(result)