"""
Программага шаарлардын аттары берилет, 
алар пробел менен жазылат. 
Бул сапты окуп, шаарлардын аттарынан тизмени түзүп, 
бул тизмеден бир шаарды кокустук(случайный) жолу менен тандаңыз. 
Тандалган шаарды экранга чыгарыңыз.
"""

"""
Программага студенттердин аттары берилет, 
алар пробел менен жазылат. 
Бул аттарды окуп, тизмеден үч студентти кокустук жолу менен тандап чыгарыңыз, 
sample функциясын колдонуу менен (алдын ала белгилүү болгондой, 
бул тизмеде үчтөн ашык студент бар).
Натыйжаны экранга бир сапка пробел аркылуу чыгарыңыз.
"""
