# 1 - тапшырма
numbers = [[2, 4, 6, 8], [1, 3, 5, 7, 9]]
"""
numbers списоктун ичинен 0 - индекстеги жана 1 - индекстеги 
списоктун элементтеринин суммасын чыгарыныздар! 
"""

# 2 - тапшырма
countries = [["Kyrgyzstan", "Kazakstan"], ["Paris", "Italiya"], ["USA", "Canada"]]
"""
жоопко
Kyrgyzstan
Italiya
Canada

ушинтип чыгарыныздар!
"""

# 3 - тапшырма
"""
Консольдон бир текст киргизебиз(input() менен).
Эгер жазылган текст Okurmen деген созго барабар болсо 'YES' болбосо 'NO' деп чыгарыныздар!
"""