# 1 - тапшырма
"""
Консольдон эки float тибиндеги сан киргизилет(input менен). 
Аларды окуп, тернардык шарттуу(Тернарный условный оператор) операторду колдонуп, 
алардын ичинен эң чоңун таап, 
d өзгөрмөсүнө ыйгаруу керек. 
Кайра жооп катары d озгормосун чыгарыш керек.

Мисал:
5.4
-3.8

Жооп:
5.4
"""


# 2 - тапшырма
"""
Консольдон бүтүн сан киригизилет(input менен). 
Бул санды окуп, msg деген өзгөрмөгө төмөнкү саптарды ыйгаруу керек:

Эгерде берилген сан 3кө бөлүнсө, "кратно 3" деп жазылсын;
Эгерде берилген сан 3кө бөлүнбөсө, "не кратно 3" деп жазылсын.
Программаны тернардык операторду колдонуп ишке ашыруу керек. 
msg өзгөрмөнүн маанисин экранга чыгаруу керек.

Мисалы:
9

Жооп:
кратно 3
"""



# 3 - тапшырма
"""
Консольдон сөз (сап) киргизилет(input менен). 
Бул сөздү окуп, msg деген өзгөрмөгө төмөнкү саптарды ыйгаруу керек:

Эгерде берилген сөз палиндром болсо анда msg озгормосуно "палиндром" деп жазылсын;
Эгерде берилген сөз палиндром болбосо, анда msg озгормосуно "палиндром эмес" деп жазылсын.
Палиндромду деген башынан дагы аягынан дагы бирдей окулган создор(шалаш, тот, заказ)
Программаны тернардык операторду колдонуп ишке ашыруу керек. msg өзгөрмөнүн маанисин экранга чыгаруу керек.


Мисалы:
Казак

Жооп:
палиндром
"""


# 4 - тапшырма
"""
Консольдон бүтүн сан 0 же 1 киргизилет(input менен). 
Бул санды окуп, төмөнкүдөй сапка өзгөртүү керек:

Эгерде сан 0 болсо, "False" деп жазылсын;
Эгерде сан 1 болсо, "True" деп жазылсын.
Программаны тернардык операторду колдонуп ишке ашыруу керек. 
Натыйжаны (сапты) экранга чыгаруу керек.

Мисалы:
1

Жооп:
True
"""


# 5 - тапшырма
"""
Консольдон эки бүтүн оң сан n жана m берилет, 
алар n < m шартын аткарат. 
Бул сандарды окуп, [n; m] диапазонундагы бүтүн сандардын квадраттарын 
бир сапта боштук менен бөлүп чыгарыңыз. 
Программаны for циклин колдонуп ишке ашыруу керек.
Мисалы:
2
4

Жооп:
4 9 16

Тушундурмо:
2**2=4
3**2=9
4**2=16
"""