
# 1 - тапшырма
"""
Программага оң сан N берилет. 
1ден Nге (кошуп) чейин бүтүн сандардын 
тизмеcин экранга чыгаруучу get_rec_N деген рекурсивдүү функция жазыңыз. 
Ар бир сан жаңы сапка чыксын.
Мисалы:
8
жооп:
1
2
3
4
5
6
7
8
"""

# 2 - тапшырма
"""
Бир параметри бар жана санды квадратка көтөрүүчү 
анонимдүү (лямбда) функциясын жазуу керек. 
Бул функцияны get_sq өзгөрмөсүнө ыйгарыңыз.
"""

# 3 - тапшырма
"""
Эки параметри бар жана биринчи бүтүн санды (биринчи параметр) 
экинчи бүтүн санга (экинчи параметр) бөлүүчү 
анонимдүү (лямбда) функцияны жарыялоо керек. 
Эгерде санды нөлгө бөлүү болуп калса, 
функция None маанисин кайтарышы керек, 
болбосо бөлүү жыйынтыгын кайтарышы керек.
"""