# 1 - тапшырма
"""
Программага эки сапта жазылган эки сан берилет. 
Программа бул эки санды окуп, алардын эң чоңун экранга чыгарышы керек. 
Тапшырманы шарттуу операторду колдонуп чечүү керек
"""

a = int(input("Enter a number: "))
b = int(input("Enter a number: "))
if a > b:
    print(a)
else:
    print(b)

# 2 - тапшырма
"""
Программага эки сапта жазылган эки бүтүн оң сан берилет. 
Программа бул сандарды m жана n өзгөрмөлөрүнө жазып, 
эгерде m саны n санына так бөлүнсө, 
анда бөлүүнүн жыйынтыгын (бүтүн сан түрүндө) экранга чыгарышы керек. 
Болбосо, "m саны n санына болунбойт" деген билдирүүнү экранга чыгарышы керек, 
m жана n ордуна тийиштүү сандарды коюп. Мисалы: "13 саны 2 санына болунбойт".
"""

m = int(input("m: "))
n = int(input("n: "))
if m % n == 0:
    print(m // n)
else:
    print("m саны n санына болунбойт")


# 3 - тапшырма
"""
Программага уч сапта жазылган үч бүтүн оң сан берилет.
Программа бул сандарды окуп, алгачкы эки сан тик бурчтуу үч бурчтуктун катеттеринин узундугу,
ал эми үчүнчү сан анын гипотенузасы экенин текшериши керек. 
(Кеңеш: текшерүү Пифагор теоремасы боюнча жүргүзүлөт c * c = a * a + b * b). 
Эгерде текшерүү туура болсо ("True" болсо), анда экранга "Yes" деп чыгаруу керек, 
болбосо "No" деп чыгаруу керек.
"""

a = int(input("a: "))
b = int(input("b: "))
c = int(input("c: "))
if c ** 2 == a ** 2 + b ** 2:
    print("Yes")
else:
    print("No")


# 4 - тапшырма
"""
Программага төрт орундуу сан берилет.
Бул сан 7 цифрасы менен аяктаарын текшериш керек. 
Эгерде ошондой болсо, экранга "Yes" деп чыгаруу керек, болбосо "No" деп чыгаруу керек.
"""

n = int(input("n: "))
if n % 10 == 7:
    print("Yes")
else:
    print("No")