"""
Функцияны чакыруу санын эсептеген декоратор жазыңыз. 
Бул декоратор функция чакырылган сайын анын счетчигин бирге кобойтуп туруу керек, 
анан ал санды консольго чыгарып туруш керек. 
Андан соң эки ар түрдүү функцияга бул декораторду колдонуп, 
алардын иштешин текшериңиз.
"""

def get_count(func):
    count = 1
    def wrapper():
        nonlocal count
        print(f"Функция {func.__name__} {count} жолу чакырылды.")
        func()
        count += 1
    return wrapper


@get_count
def hello():
    print("Салам!")

@get_count
def welcome():
    print("Кош келиниз!")


hello()
hello()
hello()
hello()
welcome()
welcome()
welcome()

# Жогорудагы кодду толук жазып чыгыныздар
# Жооп томонкудой чыгыш керек
"""
Функция hello 1 жолу чакырылды.
Салам!
Функция hello 2 жолу чакырылды.
Салам!
Функция welcome 1 жолу чакырылды.
Кош келиниз!
Функция welcome 2 жолу чакырылды.
Кош келиниз!
Функция welcome 3 жолу чакырылды.
Кош келиниз!
"""
