# 1 - тапшырма
"""
Консольдон бизге бир текст берилет(input() менен),
анын ичинен канча сызыкча(- или дефис) бар экенин табынынздар?
"""


# 2 - тапшырма
"""
Консольдон бизге бир текст берилет(input() менен),
анын ичинен табыш керек ka деген создун индексин
Например:
abrakadabra
Жоопко:
4
"""


# 3 - тапшырма
"""
Консольдон бизге бир текст берилет(input() менен),
анын ичинен уч сызыкчага(---) барабер жердин бардыгын
бир сызыкчага(-) алмаштырыш керек

Например:
dobavlyaem---slagi--slug-k--url---adresam
Жоопко:
dobavlyaem-slagi-slug-k-url-adresam
"""

