# 1 - тапшырма
'''
Бизге консольдон бир текст берилет,
анын эн биринчи 4 символун чынарыныздар,
жазылган тексттин узундугу 4 тон узун болсун.
Мисалы:
Python! деген текст берилсе
Жоопко:
Pyth
'''
# text = input("Text: ")
# print(text[:4])


# 2 - тапшырма
'''
Бизге консольдон бир текст берилет,
анын эн акыркы 3 символун чынарыныздар,
жазылган тексттин узндугу 3 тон узун болсун.
Мисалы:
Python! деген текст берилсе
Жоопко:
on!
'''
#  p  y  t  h  o  n
# -6 -5 -4 -3 -2 -1
# text = input("Text: ")
# print(text[-3:])


# 3 - тапшырма
'''
Бизге консольдон бир текст берилет,
анын жуп(четный) орундагы символдорун чыгарыныздар.
Мисалы:
Python! деген текст берилсе
Жоопко:
Pto!
'''
#  p  y  t  h  o  n
#  0  1  2  3  4  5
text = input("Text: ")
print(text[1::2])
# [0:end:2]


