# 1 - тапшырма
'''
Бизге консольдон бир текст берилет,
анын эн биринчи 4 символун чынарыныздар,
жазылган тексттин узундугу 4 тон узун болсун.
Мисалы:
Python! деген текст берилсе
Жоопко:
Pyth
'''


# 2 - тапшырма
'''
Бизге консольдон бир текст берилет,
анын эн акыркы 3 символун чынарыныздар,
жазылган тексттин узндугу 3 тон узун болсун.
Мисалы:
Python! деген текст берилсе
Жоопко:
on!
'''


# 3 - тапшырма
'''
Бизге консольдон бир текст берилет,
анын жуп(четный) орундагы символдорун чыгарыныздар.
Мисалы:
Python! деген текст берилсе
Жоопко:
Pto!
'''

