# 1 - тапшырма
"""
Консольдон бир нече сандарды инпуттун жардамы менен киргизебиз.
Аларды словарга(dictionary) сакташ керек, мындай кылып:
Эгер сан он сан болсо ключ катары сандын озун, 
мааниси(значение)катары "+"
Эгер сан терс сан болсо ключ катары сандын озун, 
мааниси(значение)катары "-" сакталыш керек

Мисалы:
-3 -5 2 7 3 -4

Жоопко
{"-3": "-", "-5": "-", "2": "+", "7": "+", "3": "+", "-4": "-"}
"""

# result = dict()
result = {}

numbers = [int(i) for i in input().split()]

for number in numbers:
    if number < 0:
        result[number] = "-"
    else:
        result[number] = "+"

print(result)


